In [1]:
# import libraries
import os
import pandas as pd

# Path to the folder containing the CSV files
folder_path = 'data/'

# Get the list of all files in the directory
files = os.listdir(folder_path)
# creat a list to storage variables names for dataframes.
data= []
# Iterate through the files in the directory
for file in files:
    # Check if the file is a CSV file
    if file.endswith('.csv'):
        # Create a DataFrame from the CSV file
        file_path = os.path.join(folder_path, file)
        df = pd.read_csv(file_path)
        
        # Create a variable name based on the file name (without extension)
        variable_name = os.path.splitext(file)[0]
        
        # Use globals() to create a variable with the name of the file
        globals()[variable_name] = df
        # append each variable name a list to can be iterable for any data process. 
        data.append(variable_name)

# Understanding the Data
Before diving into the recommendation system, itâ€™s essential to understand the data. Here are the key datasets provided by CareerVillage.org

In [2]:
# display the first 5 rows of answers.
answers.head()

,answers_id,answers_author_id,answers_question_id,answers_date_added,answers_body
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...
2,eaa66ef919bc408ab5296237440e323f,cbd8f30613a849bf918aed5c010340be,eb80205482e4424cad8f16bc25aa2d9c,2018-05-02 02:41:02 UTC+0000,"<p>Dear Priyanka,</p><p>Greetings! I have answ..."
3,1a6b3749d391486c9e371fbd1e605014,7e72a630c303442ba92ff00e8ea451df,4ec31632938a40b98909416bdd0decff,2017-05-10 19:00:47 UTC+0000,<p>I work for a global company who values high...
4,5229c514000446d582050f89ebd4e184,17802d94699140b0a0d2995f30c034c6,2f6a9a99d9b24e5baa50d40d0ba50a75,2017-10-13 22:07:33 UTC+0000,I agree with Denise. Every single job I've had...

In [3]:
# rename common columns in dataframes to can be able make relations and merging them.
answers.rename(columns={'answers_author_id':'author_id','answers_question_id':'question_id'}, inplace=True)

In [4]:
# get infomation about answers
answers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51123 entries, 0 to 51122
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   answers_id          51123 non-null  object
 1   author_id           51123 non-null  object
 2   question_id         51123 non-null  object
 3   answers_date_added  51123 non-null  object
 4   answers_body        51122 non-null  object
dtypes: object(5)
memory usage: 2.0+ MB

In [5]:
# display the first 5 rows of answers score.
answer_scores.head()

                                 id  score
0  7b2bb0fc0d384e298cffa6afde9cf6ab      1
1  7640a6e5d5224c8681cc58de860858f4      5
2  3ce32e236fa9435183b2180fb213375c      2
3  fa30fe4c016043e382c441a7ef743bfb      0
4  71229eb293314c8a9e545057ecc32c93      2

In [6]:
# rename common columns in dataframes to can be able make relations and merging them.
answer_scores.rename(columns={'id':'answers_id'},inplace=True)

In [7]:
# get information about answer score.
answer_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51138 entries, 0 to 51137
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   answers_id  51138 non-null  object
 1   score       51138 non-null  int64
dtypes: int64(1), object(1)
memory usage: 799.2+ KB

In [8]:
# display the first 5 rows of answers.
emails.head()

,emails_id,emails_recipient_id,emails_date_sent,emails_frequency_level
0,2337714,0c673e046d824ec0ad0ebe012a0673e4,2018-12-07 01:05:40 UTC+0000,email_notification_daily
1,2336077,0c673e046d824ec0ad0ebe012a0673e4,2018-12-06 01:14:15 UTC+0000,email_notification_daily
2,2314660,0c673e046d824ec0ad0ebe012a0673e4,2018-11-17 00:38:27 UTC+0000,email_notification_daily
3,2312639,0c673e046d824ec0ad0ebe012a0673e4,2018-11-16 00:32:19 UTC+0000,email_notification_daily
4,2299700,0c673e046d824ec0ad0ebe012a0673e4,2018-11-08 00:16:40 UTC+0000,email_notification_daily

In [9]:
# get information about emails.
emails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1850101 entries, 0 to 1850100
Data columns (total 4 columns):
 #   Column                  Dtype
---  ------                  -----
 0   emails_id               int64
 1   emails_recipient_id     object
 2   emails_date_sent        object
 3   emails_frequency_level  object
dtypes: int64(1), object(3)
memory usage: 56.5+ MB

In [10]:
# display the first 5 rows of comments.
comments.head()

,comments_id,comments_author_id,comments_parent_content_id,comments_date_added,comments_body
0,f30250d3c2ca489db1afa9b95d481e08,9fc88a7c3323466dbb35798264c7d497,b476f9c6d9cd4c50a7bacdd90edd015a,2019-01-31 23:39:40 UTC+0000,"First, you speak to recruiters. They are train..."
1,ca9bfc4ba9464ea383a8b080301ad72c,de2415064b9b445c8717425ed70fd99a,ef4b6ae24d1f4c3b977731e8189c7fd7,2019-01-31 20:30:47 UTC+0000,Most large universities offer study abroad pro...
2,c354f6e33956499aa8b03798a60e9386,6ed20605002a42b0b8e3d6ac97c50c7f,ca7a9d7a95df471c816db82ee758f57d,2019-01-31 18:44:04 UTC+0000,"First, I want to put you at ease that the oppo..."
3,73a6223948714c5da6231937157e4cb7,d02f6d9faac24997a7003a59e5f34bd3,c7a88aa76f5f49b0830bfeb46ba17e4d,2019-01-31 17:53:28 UTC+0000,Your question submission was great! I just wan...
4,55a89a9061d44dd19569c45f90a22779,e78f75c543e84e1c94da1801d8560f65,c7a88aa76f5f49b0830bfeb46ba17e4d,2019-01-31 14:51:53 UTC+0000,Thank you. I'm new to this site. I'm sorry if ...

In [11]:
# rename common columns in dataframes to can be able make relations and merging them.
comments.rename(columns={'comments_author_id':'author_id','comments_parent_content_id':'parent_content_id'},inplace=True)

In [12]:
#get information about comments.
comments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14966 entries, 0 to 14965
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   comments_id          14966 non-null  object
 1   author_id            14966 non-null  object
 2   parent_content_id    14966 non-null  object
 3   comments_date_added  14966 non-null  object
 4   comments_body        14962 non-null  object
dtypes: object(5)
memory usage: 584.7+ KB

In [13]:
# display the first 5 rows of group membership.
group_memberships.head()

         group_memberships_group_id         group_memberships_user_id
0  eabbdf4029734c848a9da20779637d03  9a5aead62c344207b2624dba90985dc5
1  eabbdf4029734c848a9da20779637d03  ea7122da1c7b4244a2184a4f9f944053
2  eabbdf4029734c848a9da20779637d03  cba603f34acb4a40b3ccb53fe6681b5d
3  eabbdf4029734c848a9da20779637d03  fa9a126e63714641ae0145557a390cab
4  eabbdf4029734c848a9da20779637d03  299da113c5d1420ab525106c242c9429

In [14]:
# rename common columns in dataframes to can be able make relations and merging them.
group_memberships.rename(columns={'group_memberships_group_id':'group_id','group_memberships_user_id':'user_id'},inplace=True)

In [15]:
# get information about group menbership.
group_memberships.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1038 entries, 0 to 1037
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   group_id  1038 non-null   object
 1   user_id   1038 non-null   object
dtypes: object(2)
memory usage: 16.3+ KB

In [16]:
# display the first 5 rows of groups.
groups.head()

                          groups_id groups_group_type
0  eabbdf4029734c848a9da20779637d03     youth program
1  7080bf8dcf78463bb03e6863887fd715     youth program
2  bc6fc50a2b444efc8ec47111b290ffb8     youth program
3  37f002e8d5e442ca8e36e972eaa55882     youth program
4  52419ff84d4b47bebd0b0a6c1263c296     youth program

In [17]:
# rename common columns in dataframes to can be able make relations and merging them.
groups.rename(columns={'groups_id':'group_id','groups_group_type':'group_type'},inplace=True)

In [18]:
# get information about groups.
groups.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   group_id    49 non-null     object
 1   group_type  49 non-null     object
dtypes: object(2)
memory usage: 916.0+ bytes

In [19]:
# display the first 5 rows of matches.
matches.head()

   matches_email_id               matches_question_id
0           1721939  332a511f1569444485cf7a7a556a5e54
1           1665388  332a511f1569444485cf7a7a556a5e54
2           1636634  332a511f1569444485cf7a7a556a5e54
3           1635498  332a511f1569444485cf7a7a556a5e54
4           1620298  332a511f1569444485cf7a7a556a5e54

In [20]:
# rename common columns in dataframes to can be able make relations and merging them.
matches.rename(columns={'matches_email_id':'emails_id','matches_question_id':'question_id'},inplace=True)

In [21]:
# get information about matches.
matches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4316275 entries, 0 to 4316274
Data columns (total 2 columns):
 #   Column       Dtype
---  ------       -----
 0   emails_id    int64
 1   question_id  object
dtypes: int64(1), object(1)
memory usage: 65.9+ MB

In [22]:
# display the first 5 rows of professionals.
professionals.head()

,professionals_id,professionals_location,professionals_industry,professionals_headline,professionals_date_joined
0,9ced4ce7519049c0944147afb75a8ce3,NaN,NaN,NaN,2011-10-05 20:35:19 UTC+0000
1,f718dcf6d2ec4cb0a52a9db59d7f9e67,NaN,NaN,NaN,2011-10-05 20:49:21 UTC+0000
2,0c673e046d824ec0ad0ebe012a0673e4,"New York, New York",NaN,NaN,2011-10-18 17:31:26 UTC+0000
3,977428d851b24183b223be0eb8619a8c,"Boston, Massachusetts",NaN,NaN,2011-11-09 20:39:29 UTC+0000
4,e2d57e5041a44f489288397c9904c2b2,NaN,NaN,NaN,2011-12-10 22:14:44 UTC+0000

In [23]:
# get information about professionals.
professionals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28152 entries, 0 to 28151
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   professionals_id           28152 non-null  object
 1   professionals_location     25054 non-null  object
 2   professionals_industry     25575 non-null  object
 3   professionals_headline     26084 non-null  object
 4   professionals_date_joined  28152 non-null  object
dtypes: object(5)
memory usage: 1.1+ MB

In [24]:
# display the first 5 rows of questions.
questions.head()

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...
2,4ec31632938a40b98909416bdd0decff,f2c179a563024ccc927399ce529094b5,2017-02-08 19:13:38 UTC+0000,Will going abroad for your first job increase ...,I'm planning on going abroad for my first job....
3,2f6a9a99d9b24e5baa50d40d0ba50a75,2c30ffba444e40eabb4583b55233a5a4,2017-09-01 14:05:32 UTC+0000,To become a specialist in business management...,i hear business management is a hard way to ge...
4,5af8880460c141dbb02971a1a8369529,aa9eb1a2ab184ebbb00dc01ab663428a,2017-09-01 02:36:54 UTC+0000,Are there any scholarships out there for stude...,I'm trying to find scholarships for first year...

In [25]:
# rename common columns in dataframes to can be able make relations and merging them.
questions.rename(columns={'questions_author_id':'author_id','questions_id':'question_id'},inplace=True)

In [26]:
# get information about questions.
questions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23931 entries, 0 to 23930
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   question_id           23931 non-null  object
 1   author_id             23931 non-null  object
 2   questions_date_added  23931 non-null  object
 3   questions_title       23931 non-null  object
 4   questions_body        23931 non-null  object
dtypes: object(5)
memory usage: 934.9+ KB

In [27]:
# display the first 5 rows of question score.
question_scores.head()

                                 id  score
0  38436aadef3d4b608ad089cf53ab0fe7      5
1  edb8c179c5d64c9cb812a59a32045f55      4
2  333464d7484b43e3866e86096bc4ddb9      6
3  4b995e60b99d4ee18346e893e007cb8f      6
4  f6b9ca94aed04ba28256492708e74f60      6

In [28]:
# rename common columns in dataframes to can be able make relations and merging them.
question_scores.rename(columns={'id':'question_id'},inplace=True)

In [29]:
# get information about question score.
question_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23928 entries, 0 to 23927
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   question_id  23928 non-null  object
 1   score        23928 non-null  int64
dtypes: int64(1), object(1)
memory usage: 374.0+ KB

In [30]:
# display the first 5 rows of school membership.
school_memberships.head()

   school_memberships_school_id        school_memberships_user_id
0                        197406  23dce13ca6164a73aec7a3cd56a4884d
1                        197398  23dce13ca6164a73aec7a3cd56a4884d
2                        199821  23dce13ca6164a73aec7a3cd56a4884d
3                        186239  9c5803ae43ca4cf6b27ea85871625116
4                        182063  9c5803ae43ca4cf6b27ea85871625116

In [31]:
# rename common columns in dataframes to can be able make relations and merging them.
school_memberships.rename(columns={'school_memberships_school_id':'school_id','school_memberships_user_id':'user_id'},inplace=True)

In [32]:
# get informations about school membership.
school_memberships.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5638 entries, 0 to 5637
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   school_id  5638 non-null   int64
 1   user_id    5638 non-null   object
dtypes: int64(1), object(1)
memory usage: 88.2+ KB

In [33]:
# display the first 5 rows of students.
students.head()

,students_id,students_location,students_date_joined
0,12a89e96755a4dba83ff03e03043d9c0,NaN,2011-12-16 14:19:24 UTC+0000
1,e37a5990fe354c60be5e87376b08d5e3,NaN,2011-12-27 03:02:44 UTC+0000
2,12b402cceeda43dcb6e12ef9f2d221ea,NaN,2012-01-01 05:00:00 UTC+0000
3,a0f431fc79794edcb104f68ce55ab897,NaN,2012-01-01 05:00:00 UTC+0000
4,23aea4702d804bd88d1e9fb28074a1b4,NaN,2012-01-01 05:00:00 UTC+0000

In [34]:
# get information about students.
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30971 entries, 0 to 30970
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   students_id           30971 non-null  object
 1   students_location     28938 non-null  object
 2   students_date_joined  30971 non-null  object
dtypes: object(3)
memory usage: 726.0+ KB

In [35]:
# display the first 5 rows of tags.
tags.head()

   tags_tag_id      tags_tag_name
0        27490            college
1          461   computer-science
2          593  computer-software
3        27292           business
4        18217             doctor

In [36]:
# rename common columns in dataframes to can be able make relations and merging them.
tags.rename(columns={'tags_tag_id':'tag_id','tags_tag_name':'tag_name'},inplace=True)

In [37]:
# gt information about tags.
tags.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16269 entries, 0 to 16268
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   tag_id    16269 non-null  int64
 1   tag_name  16268 non-null  object
dtypes: int64(1), object(1)
memory usage: 254.3+ KB

In [38]:
# display the first 5 rows of tags question.
tag_questions.head()

   tag_questions_tag_id         tag_questions_question_id
0                 28930  cb43ebee01364c68ac61d347a393ae39
1                 28930  47f55e85ce944242a5a347ab85a8ffb4
2                 28930  ccc30a033a0f4dfdb2eb987012f25792
3                 28930  e30b274e48d741f7bf50eb5e7171a3c0
4                 28930  3d22742052df4989b311b4195cbb0f1a

In [39]:
# rename common columns in dataframes to can be able make relations and merging them.
tag_questions.rename(columns={'tag_questions_tag_id':'tag_id','tag_questions_question_id':'question_id'}, inplace=True)

In [40]:
# get informations about tag questions
tag_questions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76553 entries, 0 to 76552
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tag_id       76553 non-null  int64
 1   question_id  76553 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.2+ MB

In [41]:
# display the first 5 rows of tag users.
tag_users.head()

   tag_users_tag_id                 tag_users_user_id
0               593  c72ab38e073246e88da7e9a4ec7a4472
1              1642  8db519781ec24f2e8bdc67c2ac53f614
2               638  042d2184ee3e4e548fc3589baaa69caf
3             11093  c660bd0dc1b34224be78a58aa5a84a63
4             21539  8ce1dca4e94240239e4385ed22ef43ce

In [42]:
# rename common columns in dataframes to can be able make relations and merging them.
tag_users.rename(columns={'tag_users_tag_id':'tag_id','tag_users_user_id':'user_id'},inplace=True)

In [43]:
# get information about tag users.
tag_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136663 entries, 0 to 136662
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   tag_id   136663 non-null  int64
 1   user_id  136663 non-null  object
dtypes: int64(1), object(1)
memory usage: 2.1+ MB

# Data Preprocessing and Cleaning
Data preprocessing is crucial to ensure that the data is clean and in the right format for analysis.

In [44]:
# cheek for names of dataframes.
for i in data:
    print(i[0])

answers
answer_scores
comments
emails
groups
group_memberships
matches
professionals
questions
question_scores
school_memberships
students
tags
tag_questions
tag_users

In [45]:
# function to drop missing values from data.
def clean():
    """
    the job of this function is:
    - to check if there are any missing values.
    - then show the shape of each data frame.
    - then drop all missing values in all data frames.
    - then recheck the shape of each data frame to ensure missing values are dropped.
    """
    for i in data:
        print(i[0],":")
        x= i[1].isna().sum()
        print(x)
        print(i[1].shape)
        print("\n" + "="*40 +"\n")
        print(i[0],":")
        i[1].dropna(inplace=True)
        y = i[1].isna().sum()
        print(y)
        print(i[1].shape)
        print("\n" + "#"*40 +"\n")

In [46]:
# call clean function to cheek and clean the data from the missing values.
clean()

answers :
answers_id            0
author_id             0
question_id           0
answers_date_added    0
answers_body          1
dtype: int64
(51123, 5)

========================================

answers :
answers_id            0
author_id             0
question_id           0
answers_date_added    0
answers_body          0
dtype: int64
(51122, 5)

########################################

answer_scores :
answers_id    0
score         0
dtype: int64
(51138, 2)

========================================

answer_scores :
answers_id    0
score         0
dtype: int64
(51138, 2)

########################################

comments :
comments_id            0
author_id              0
parent_content_id      0
comments_date_added    0
comments_body          4
dtype: int64
(14966, 5)

========================================

comments :
comments_id            0
author_id              0
parent_content_id      0
comments_date_added    0
comments_body          0
dtype: int64
(14962, 5)

########################################

emails :
emails_id                 0
emails_recipient_id       0
emails_date_sent          0
emails_frequency_level    0
dtype: int64
(1850101, 4)

========================================

emails :
emails_id                 0
emails_recipient_id       0
emails_date_sent          0
emails_frequency_level    0
dtype: int64
(1850101, 4)

########################################

groups :
group_id      0
group_type    0
dtype: int64
(49, 2)

========================================

groups :
group_id      0
group_type    0
dtype: int64
(49, 2)

########################################

group_memberships :
group_id    0
user_id     0
dtype: int64
(1038, 2)

========================================

group_memberships :
group_id    0
user_id     0
dtype: int64
(1038, 2)

########################################

matches :
emails_id      0
question_id    0
dtype: int64
(4316275, 2)

========================================

matches :
emails_id      0
question_id    0
dtype: int64
(4316275, 2)

########################################

professionals :
professionals_id                0
professionals_location       3098
professionals_industry       2577
professionals_headline       2068
professionals_date_joined       0
dtype: int64
(28152, 5)

========================================

professionals :
professionals_id             0
professionals_location       0
professionals_industry       0
professionals_headline       0
professionals_date_joined    0
dtype: int64
(22902, 5)

########################################

questions :
question_id             0
author_id               0
questions_date_added    0
questions_title         0
questions_body          0
dtype: int64
(23931, 5)

========================================

questions :
question_id             0
author_id               0
questions_date_added    0
questions_title         0
questions_body          0
dtype: int64
(23931, 5)

########################################

question_scores :
question_id    0
score          0
dtype: int64
(23928, 2)

========================================

question_scores :
question_id    0
score          0
dtype: int64
(23928, 2)

########################################

school_memberships :
school_id    0
user_id      0
dtype: int64
(5638, 2)

========================================

school_memberships :
school_id    0
user_id      0
dtype: int64
(5638, 2)

########################################

students :
students_id                0
students_location       2033
students_date_joined       0
dtype: int64
(30971, 3)

========================================

students :
students_id             0
students_location       0
students_date_joined    0
dtype: int64
(28938, 3)

########################################

tags :
tag_id      0
tag_name    1
dtype: int64
(16269, 2)

========================================

tags :
tag_id      0
tag_name    0
dtype: int64
(16268, 2)

########################################

tag_questions :
tag_id         0
question_id    0
dtype: int64
(76553, 2)

========================================

tag_questions :
tag_id         0
question_id    0
dtype: int64
(76553, 2)

########################################

tag_users :
tag_id     0
user_id    0
dtype: int64
(136663, 2)

========================================

tag_users :
tag_id     0
user_id    0
dtype: int64
(136663, 2)

########################################

In [47]:
# check for answers body to extract and clean answer body.
answers['answers_body'].iloc[0]

'<p>Hi!</p>\n<p>You are asking a very interesting question.  I am giving you two sites that will give you some of an explanation that may answer your question.</p>\n<p>http://mathforum.org/dr.math/faq/faq.why.math.html</p>\n<p>http://www.mathworksheetscenter.com/mathtips/mathissoimportant.html</p>\n<p>Let me know if this helps</p>'

In [48]:
# import re for regular expression
import re 
# create a function to extract all answers body.
def extract_text(text):
    clr = re.compile('<.*?>')
    cleantext = re.sub(clr, '', text)
    return cleantext.strip()

In [49]:
# apply the function of extract text.
answers['answers_body'] = answers['answers_body'].apply(extract_text)

In [50]:
# check answers to ensure the function worked well.
answers.head()

,answers_id,author_id,question_id,answers_date_added,answers_body
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,Hi!\nYou are asking a very interesting questio...
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,Hi. I joined the Army after I attended college...
2,eaa66ef919bc408ab5296237440e323f,cbd8f30613a849bf918aed5c010340be,eb80205482e4424cad8f16bc25aa2d9c,2018-05-02 02:41:02 UTC+0000,"Dear Priyanka,Greetings! I have answered this ..."
3,1a6b3749d391486c9e371fbd1e605014,7e72a630c303442ba92ff00e8ea451df,4ec31632938a40b98909416bdd0decff,2017-05-10 19:00:47 UTC+0000,I work for a global company who values highly ...
4,5229c514000446d582050f89ebd4e184,17802d94699140b0a0d2995f30c034c6,2f6a9a99d9b24e5baa50d40d0ba50a75,2017-10-13 22:07:33 UTC+0000,I agree with Denise. Every single job I've had...

In [51]:
# create a list of cleanned dataframes to can be iterable to save them in to csv files.
datas=['answers','answer_scores','comments','emails','groups','group_memberships','matches','professionals','questions','question_scores','school_memberships','students','tags','tag_questions','tag_users']

In [52]:
# iterate each cleanned data frame and save it into csv file to can import it in another notebook.
for i in datas:
    df = globals()[i]
    filename = f"{i}.csv"
    df.to_csv(f"data1/{filename}",index=False)